user_tutorial/fluidOptFoam/fluidOpt_bend_180deg/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(p|p_adj_U|p_test)"
    {
        solver          GAMG;
        tolerance       1e-9;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(U|U_adj_U|U_test|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-9;
        relTol          0.1;
    }

     "(gamma_densityfilter|adjoint_sensitivity|cost_sensitivity)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}

relaxationFactors
{
    fields
    {
        "(p|p_adj_U|p_test)"      0.3;
        T                   0.7;
        alpha_U               0.1;
    }
    equations
    {
        "(U|U_adj_U|U_test)"      0.7;
        "(k|epsilon)"       0.7;
    }
}

inlet_outlet
{
    numberConstraintPatches      2;
    constraintPatchesNames       (inlet outlet);
}
// ************************************************************************* //
